### Heroes Of Pymoli Data Analysis
* Of the 1163 active players, the vast majority are male (84%). There also exists, a smaller, but notable proportion of female players (14%).

* Our peak age demographic falls between 20-24 (44.8%) with secondary groups falling between 15-19 (18.60%) and 25-29 (13.4%).  
-----

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [36]:
# Dependencies and Setup
import pandas as pd
import numpy as np
import csv

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# set the data frame to the csv
purchase_data_df = pd.read_csv(file_to_load)

## Player Count

* Display the total number of players

In [4]:
#get the columns
heroes_df = pd.DataFrame(purchase_data_df)
heroes_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [5]:
#get the total players.. and drop dupes. and the 
player_dem = heroes_df.loc[:, ["Gender", "SN", "Age"]]
player_dem.head()

player_dem = player_dem.drop_duplicates()

player_count = player_dem.count()[0]
player_count

576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [38]:
#do this stuff AND DONT FREAKING OVERWRITE PREVIOUS DATA FRAMES
unique_items_df = purchase_data_df["Item Name"].nunique()
avg_price = purchase_data_df["Price"].mean()
number_of_purchases = purchase_data_df["Purchase ID"].count()
total_rev = sum(purchase_data_df["Price"])
print(unique_items_df)
print(avg_price)
print(number_of_purchases)
print(total_rev)

179
3.050987179487176
780
2379.7699999999973

In [39]:
#so what does not sure why the order is off, bc ive played with it...  well damn it i messed it up and it stopped working... 
combined_analysis_df = pd.DataFrame([{"Total Revenue": total_rev, "Number of Purchases": number_of_purchases, "Average Price": avg_price, 
                     "Number of Unique Items": unique_items_df}])
combined_analysis_df.style.format({"Average Price":"{:.2f}"})
#got rid of a line and it started working again

In [3]:
#

   Number of Unique Items Average Price Number of Purchases Total Revenue
0                     183         $3.05                 780     $2,379.77

## Gender Demographics

# Percentage and Count of Male Players


# Percentage and Count of Female Players


# Percentage and Count of Other / Non-Disclosed

In [40]:
# Group by Gender
gender_group = purchase_data_df.groupby("Gender")

# Count user names "SN" by gender
total_gender = gender_group["SN"].nunique()

percentage_of_players = total_gender / player_count* 100

# get some demographics 
demographics = pd.DataFrame({"Total Count": total_gender, "Percentage of Players": percentage_of_players})

# make it match the example formatting and fix the decimals 
demographics.sort_values(["Total Count"], ascending = False).style.format({"Percentage of Players":"{:.2f}"})

                       Total Count  Percentage of Players
Male                           484                  84.03
Female                          81                  14.06
Other / Non-Disclosed           11                   1.91


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [45]:
#purchase count
purchase_count = gender_group["Purchase ID"].count()
#avg purchase price
avg_PP = gender_group["Price"].mean()
#total purchase value
gender_group_value = gender_group["Price"].sum()
#avg purchase per person
avg_per_person = gender_group_value/total_gender


gender_purchases = pd.DataFrame({"Amount of Purchases": purchase_count, "Average Price":avg_PP, 
                                 "Total Purchase Value": gender_group_value, "Average Purchase Per Person": avg_per_person})
gender_purchases.style.format({"Average Price":"{:,.2f}"})
#when i added the Average Purchase Per Person to the formating it didnt work.. fml

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [46]:
#make age bins.. 03-Ins_Binning
bins = [0, 9.90, 14.90, 19.90, 24.90, 29.90, 34.90, 39.90, 9999]
group_lables = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40"]

heroes_group=player_dem.loc[:,["SN","Age"]]
heroes_group["Age Ranges"] = pd.cut(heroes_group["Age"], bins, labels=group_lables)

age_totals = heroes_group["Age Ranges"].value_counts()
age_percentage = (age_totals / player_count * 100).round(2)
age_dems = pd.DataFrame({"Age Group Total": age_totals, "Percentage of Players Age": age_percentage})

age_dems.sort_index()

       Age Group Total  Percentage of Players Age
<10                 17                       2.95
10-14               22                       3.82
15-19              107                      18.58
20-24              258                      44.79
25-29               77                      13.37
30-34               52                       9.03
35-39               31                       5.38
40                  12                       2.08

       Total Count  Percentage of Players
<10             17                   2.95
10-14           22                   3.82
15-19          107                  18.58
20-24          258                  44.79
25-29           77                  13.37
30-34           52                   9.03
35-39           31                   5.38
40+             12                   2.08

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [47]:
#purchase age
purchase_age= purchase_data_df
#add age group and do the bins
purchase_age["Age Group"] = pd.cut(purchase_age["Age"], bins, labels=groups)

#group data frame by age group
purchase_age = purchase_age.groupby("Age Group")

#total purchase count
purchase_count = purchase_age["SN"].count()

#average price
avg_price = purchase_age["Price"].mean()

#total purchase value
total_price = purchase_age["Price"].sum()

#average Total Purchase Per Person... demographics might be why my table is messeed up ... jk i switched it to purchase count bc im an idiot 
avg_total_purchase = (total_price/purchase_count)

#create and format purchase analysis by age data frame
age_analysis_df = pd.DataFrame({"Purchase Count":purchase_count, "Average Purchase Price":avg_price, "Total Purchase Value":total_price, 
                        "Average Total Purchase Per Person": avg_total_purchase})

#format and do some dollars, finally got it to work, 
age_analysis_df.style.format({"Average Purchase Price": "${:.2f}", 'Total Purchase Value': "${:.2f}","Average Total Purchase Per Person": "${:.2f}"})

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [48]:
#using the orginal purchase data df bc i know its consistant 
spender_df = purchase_data_df.groupby("SN")

sn_purchases = spender_df["SN"].count()
#Checked, that worked. 

sn_avg = spender_df["Price"].mean()

sn_total = spender_df["Price"].sum()

sn_table = pd.DataFrame({"Purchase Count": sn_purchases, "Average Purchase Price":sn_avg, "Total Purhase Value": sn_total})

sn_table.sort_values("Purchase Count", ascending=False).head()

             Purchase Count  Average Purchase Price  Total Purhase Value
SN
Lisosia93                 5                3.792000                18.96
Iral74                    4                3.405000                13.62
Idastidru52               4                3.862500                15.45
Asur53                    3                2.480000                 7.44
Inguron55                 3                3.703333                11.11

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [22]:
pop_items = purchase_data_df[["Item ID", "Item Name", "Price"]]

#group item id and name 
pop_names = pop_items.groupby(["Item ID", "Item Name"])

#total item purchase count
item_purchase_count = pop_names["Price"].count()

#purchase value, i understand i shouldnt use pvalue bc it is for stats, but it works for a df name
p_value = pop_names["Price"].sum()

#prices... 
price = (p_value/item_purchase_count)



#using top_pop bc it sounds funny
top_pop = pd.DataFrame({"Purchase Count":item_purchase_count, "Item Price":price,
                       "Total Purchase Value":p_value})
#checking to see if it worked
top_pop.head()
#top_pop sortin
top_pop.sort_values("Purchase Count", ascending=False).head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
145,Fiery Glass Crusader,9,4.58,41.22
108,"Extraction, Quickblade Of Trembling Hands",9,3.53,31.77
82,Nirvana,9,4.90,44.10
19,"Pursuit, Cudgel of Necromancy",8,1.02,8.16

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
82,Nirvana,9,$4.90,$44.10
19,"Pursuit, Cudgel of Necromancy",8,$1.02,$8.16

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [ ]:
#sort this sucker so you can enjoy friday night, who cares about dollar signs

In [49]:
top_pop.sort_values("Total Purchase Value", ascending=False).head()

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
82,Nirvana,9,4.90,44.10
145,Fiery Glass Crusader,9,4.58,41.22
92,Final Critic,8,4.88,39.04
103,Singed Scalpel,8,4.35,34.80

In [10]:
#hell yeah its done

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
92,Final Critic,8,$4.88,$39.04
103,Singed Scalpel,8,$4.35,$34.80

In [ ]:
#next time i really need to do this all at once... because when i start and stop over a few days i lose track of what and how i do things
#it is not ideal to come back confused and have to re do things and accidently deleate things